{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 140, 1], "input_dtype": "float32", "sparse": false, "name": "input_22"}, "inbound_nodes": [], "name": "input_22"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_77", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_22", 0, 0]]], "name": "convolution2d_77"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_65", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_77", 0, 0]]], "name": "maxpooling2d_65"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_78", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_65", 0, 0]]], "name": "convolution2d_78"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_66", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_78", 0, 0]]], "name": "maxpooling2d_66"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_79", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_66", 0, 0]]], "name": "convolution2d_79"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_67", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_79", 0, 0]]], "name": "maxpooling2d_67"}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_15"}, "inbound_nodes": [[["maxpooling2d_67", 0, 0]]], "name": "dropout_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_80", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["dropout_15", 0, 0]]], "name": "convolution2d_80"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}, "inbound_nodes": [[["convolution2d_80", 0, 0]]], "name": "flatten_8"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_43", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1920, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}, "inbound_nodes": [[["flatten_8", 0, 0]]], "name": "dense_43"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_16"}, "inbound_nodes": [[["dense_43", 0, 0]]], "name": "dropout_16"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_44", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_16", 0, 0]]], "name": "dense_44"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_45", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_16", 0, 0]]], "name": "dense_45"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_46", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_16", 0, 0]]], "name": "dense_46"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_47", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_16", 0, 0]]], "name": "dense_47"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_48", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_16", 0, 0]]], "name": "dense_48"}], "input_layers": [["input_22", 0, 0]], "output_layers": [["dense_44", 0, 0], ["dense_45", 0, 0], ["dense_46", 0, 0], ["dense_47", 0, 0], ["dense_48", 0, 0]], "name": "model_8"}}